import IconArrowRight from "@/components/icons/IconArrowRight";
import { Metadata } from "next";
import Link from "next/link";

export const metadata: Metadata = {
  title: "404 — страница не найдена | ДАБЛ-Ю",
  description:
    "Страница не найдена. Вернитесь на главную архитектурного бюро ДАБЛ-Ю или просмотрите наши проекты и новости.",
  robots: {
    index: false,
    follow: false,
  },
};

export default function NotFound() {
  return (
    <div className="text-white flex min-h-screen items-center justify-center bg-[var(--color-black)] flex-col relative overflow-hidden">
      <svg
        width="1224"
        height="760"
        viewBox="0 0 1224 760"
        fill="none"
        xmlns="http://www.w3.org/2000/svg"
        className="absolute bottom-0  "
      >
        <path
          data-figma-bg-blur-radius="30"
          d="M234.145 496.111V731.853C234.145 747.4 246.797 760 262.407 760H311.872C327.482 760 340.134 747.4 340.134 731.853V496.111C340.134 336.414 438.147 199.515 577.529 141.817C599.696 132.64 624.666 132.64 646.833 141.817C786.215 199.515 884.228 336.414 884.228 496.111L884.228 731.853C884.228 747.4 896.881 760 912.49 760H969.02C984.63 760 997.289 747.4 997.289 731.853V496.111C997.289 222.116 774.252 0 499.127 0C223.995 0 0.964722 222.116 0.964722 496.111V731.853C0.964722 747.4 13.617 760 29.2266 760H85.757C101.367 760 114.019 747.4 114.019 731.853V496.111C114.019 284.3 286.44 112.593 499.127 112.593C509.899 112.593 510.822 127.845 500.572 131.149C345.961 180.975 234.145 325.539 234.145 496.111Z"
          fill="#30302F"
          fillOpacity="0.6"
        />

        <path
          data-figma-bg-blur-radius="30"
          d="M1223.97 496.111C1223.97 222.116 1000.93 0 725.807 0C719.069 0 718.647 9.71649 725.231 11.1293C949.727 59.2965 1117.97 258.137 1117.97 496.111V731.853C1117.97 747.4 1130.63 760 1146.24 760H1195.7C1211.31 760 1223.97 747.4 1223.97 731.853V496.111Z"
          fill="#30302F"
          fillOpacity="0.6"
        />
        <defs>
          <clipPath
            id="bgblur_0_1979_16639_clip_path"
            transform="translate(29.0391 30)"
          >
            <path d="M234.145 496.111V731.853C234.145 747.4 246.797 760 262.407 760H311.872C327.482 760 340.134 747.4 340.134 731.853V496.111C340.134 336.414 438.147 199.515 577.529 141.817C599.696 132.64 624.666 132.64 646.833 141.817C786.215 199.515 884.228 336.414 884.228 496.111L884.228 731.853C884.228 747.4 896.881 760 912.49 760H969.02C984.63 760 997.289 747.4 997.289 731.853V496.111C997.289 222.116 774.252 0 499.127 0C223.995 0 0.964722 222.116 0.964722 496.111V731.853C0.964722 747.4 13.617 760 29.2266 760H85.757C101.367 760 114.019 747.4 114.019 731.853V496.111C114.019 284.3 286.44 112.593 499.127 112.593C509.899 112.593 510.822 127.845 500.572 131.149C345.961 180.975 234.145 325.539 234.145 496.111Z" />
          </clipPath>
          <clipPath
            id="bgblur_1_1979_16639_clip_path"
            transform="translate(-690.516 30)"
          >
            <path d="M1223.97 496.111C1223.97 222.116 1000.93 0 725.807 0C719.069 0 718.647 9.71649 725.231 11.1293C949.727 59.2965 1117.97 258.137 1117.97 496.111V731.853C1117.97 747.4 1130.63 760 1146.24 760H1195.7C1211.31 760 1223.97 747.4 1223.97 731.853V496.111Z" />
          </clipPath>
        </defs>
      </svg>

      <div className="z-10 flex flex-col px-4">
        <span className='[font-family:"NeutralFace"] font-bold text-[136px] md:text-[20.98rem] leading-[0.96] pb-4 text-center'>
          404
        </span>
        <p className="subtitle text-center pb-5 md:pb-10">
          Возможно, ссылка устарела или страница была удалена.{" "}
          <br className="hidden md:block" />
          Можете вернуться на главную
        </p>
        <Link
          href={"/"}
          className="flex items-center gap-2 w-full justify-center py-4 border-2 border-[var(--color-primary)] rounded-sm cursor-pointer "
        >
          <IconArrowRight />
          Перейти на главную
        </Link>
      </div>
    </div>
  );
}
